gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
            case S5_SET_RTC_ALARM:;

                watchdog_message_maple("Upating RTC Alarm\r\n", BPK_Code_Debug);
                watchdog_calculate_rtc_alarm_time();

                state = S6_CHECK_INCOMING_REQUEST;

                break;

            case S6_CHECK_INCOMING_REQUEST:
                // watchdog_message_maple("Checking incoming requests\r\n", BPK_Code_Debug);

                if (comms_stm32_request_pending(MAPLE_UART) == TRUE) {
                    state = S7_EXECUTE_REQUEST;
                } else {
                    state = S3_STM32_SLEEP;
                }

                break;

            case S7_EXECUTE_REQUEST:;
                // watchdog_message_maple("Executing request\r\n", BPK_Code_Debug);

                // Execute requests until none left
                uint32_t processNextPacket = TRUE;

                while (processNextPacket == TRUE) {

                    // Clear flag
                    processNextPacket = FALSE;

                    // Process anything Maple sends to the STM32
                    bpk_packet_t bpacket1, bpacket2;
                    if (comms_process_rxbuffer(BUFFER_2_ID, &bpacket1) == TRUE) {
                        // log_message("Bpacket: %i %i %i %i %i %i\r\n", bpacket1.Receiver.val, bpacket1.Sender.val,
                        //             bpacket1.Request.val, bpacket1.Code.val, bpacket1.Data.numBytes,
                        //             bpacket1.Data.bytes[0]);

                        // watchdog_message_maple("Got request from maple\r\n", BPK_Code_Debug);
                        if (stm32_match_maple_request(&bpacket1) != TRUE) {
                            process_watchdog_stm32_request(&bpacket1);
                        }

                        // Set flag incase there is another incoming packet afterwards
                        processNextPacket = TRUE;
                    }

                    // Process anything the ESP32 sends to Maple
                    if (comms_process_rxbuffer(BUFFER_1_ID, &bpacket2) == TRUE) {
                        // watchdog_message_maple("Got request from ESP32\r\n", BPK_Code_Debug);
                        if (stm32_match_esp32_request(&bpacket2) != TRUE) {
                            process_watchdog_stm32_request(&bpacket2);
                        }

                        // Set flag incase there is another incoming packet afterwards
                        processNextPacket = TRUE;
                    }
                }

                state = S8_START_COUNT_DOWN;
                break;

            case S8_START_COUNT_DOWN:;
                // watchdog_message_maple("Starting count down\r\n", BPK_Code_Debug);

                uint32_t countDownEnd;
                uint8_t overflow1 = FALSE;
                if ((UINT_32_BIT_MAX_VALUE - SysTick->VAL) < COUNT_DOWN_TIME) {
                    countDownEnd = COUNT_DOWN_TIME - (UINT_32_BIT_MAX_VALUE - SysTick->VAL);
                    overflow1    = TRUE;
                } else {
                    countDownEnd = HAL_GetTick() + COUNT_DOWN_TIME;
                }

                while ((HAL_GetTick() <= countDownEnd) || (overflow1 == TRUE && countDownEnd < HAL_GetTick())) {

                    if (overflow1 == TRUE && countDownEnd <= HAL_GetTick()) {
                        overflow1 = FALSE;
                    }

                    // Continue waiting if there is no request from ESP32 or Maple
                    if ((comms_stm32_request_pending(MAPLE_UART) != TRUE) &&
                        (comms_stm32_request_pending(ESP32_UART) != TRUE)) {
                        continue;
                    }

                    state = S7_EXECUTE_REQUEST;
                    break;
                }

                if (state != S7_EXECUTE_REQUEST) {
                    state = S3_STM32_SLEEP;
                }
                // watchdog_message_maple("Exiting count down\r\n", BPK_Code_Debug);
                break;

            default:;
                char errMsg[50];
                sprintf(errMsg, "Invalid state found: %i\r\n", state);
                watchdog_message_maple(errMsg, BPK_Code_Error);
                break;
        }
    }
}

void watchdog_report_success(const bpk_request_t Request) {

    bpk_packet_t Bpacket;
    bpk_create_packet(&Bpacket, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, Request, BPK_Code_Success, 0, NULL);

    bpk_buffer_t packetBuffer;
    bpacket_to_buffer(&Bpacket, &packetBuffer);

    comms_transmit(MAPLE_UART, packetBuffer.buffer, packetBuffer.numBytes);
}

void watchdog_create_and_send_bpacket_to_maple(const bpk_request_t Request, const bpk_code_t Code, uint8_t numBytes,
                                               uint8_t* data) {
    bpk_packet_t Bpacket;
    bpk_buffer_t packetBuffer;
    bpk_create_packet(&Bpacket, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, Request, Code, numBytes, data);
    bpacket_to_buffer(&Bpacket, &packetBuffer);
    comms_transmit(MAPLE_UART, packetBuffer.buffer, packetBuffer.numBytes);
}

void watchdog_create_and_send_bpacket_to_esp32(const bpk_request_t Request, const bpk_code_t Code, uint8_t numBytes,
                                               uint8_t* data) {
    bpk_packet_t Bpacket;
    bpk_buffer_t packetBuffer;
    bpk_create_packet(&Bpacket, BPK_Addr_Receive_Esp32, BPK_Addr_Send_Stm32, Request, Code, numBytes, data);
    bpacket_to_buffer(&Bpacket, &packetBuffer);
    comms_transmit(ESP32_UART, packetBuffer.buffer, packetBuffer.numBytes);
}

void watchdog_message_maple(char* string, bpk_code_t Code) {

    bpk_packet_t Bpacket;
    bpk_buffer_t packetBuffer;

    switch (Code.val) {

        case BPK_CODE_TODO:
        case BPK_CODE_SUCCESS:
        case BPK_CODE_DEBUG:
        case BPK_CODE_ERROR:
            bpacket_create_sp(&Bpacket, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Request_Message, Code, string);
            break;

        default:
            bpacket_create_sp(&Bpacket, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Request_Message,
                              BPK_Code_Error, "Failed to create watchdog message!\r\n");
    }

    bpacket_to_buffer(&Bpacket, &packetBuffer);
    comms_transmit(MAPLE_UART, packetBuffer.buffer, packetBuffer.numBytes);
}

void watchdog_send_bpacket_to_esp32(bpk_packet_t* Bpacket) {
    bpk_buffer_t bpacketBuffer;
    bpacket_to_buffer(Bpacket, &bpacketBuffer);
    comms_transmit(ESP32_UART, bpacketBuffer.buffer, bpacketBuffer.numBytes);
}

