gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
void process_watchdog_stm32_request(bpk_packet_t* Bpacket) {

    switch (Bpacket->Request.val) {

        case BPK_REQ_LED_RED_ON:

            if (Bpacket->Code.val == BPK_Code_Execute.val) {
                watchdog_create_and_send_bpacket_to_esp32(BPK_Req_Led_Red_On, BPK_Code_Execute, 0, NULL);
                break;
            }

            if (Bpacket->Code.val == BPK_Code_Success.val) {
                watchdog_report_success(BPK_Req_Led_Red_On);
                break;
            }

            watchdog_message_maple("Invalid code for LED on!\r\n", BPK_Code_Error);

            break;

        case BPK_REQ_LED_RED_OFF:

            if (Bpacket->Code.val == BPK_Code_Execute.val) {
                watchdog_create_and_send_bpacket_to_esp32(BPK_Req_Led_Red_Off, BPK_Code_Execute, 0, NULL);
                break;
            }

            if (Bpacket->Code.val == BPK_Code_Success.val) {
                watchdog_report_success(BPK_Req_Led_Red_Off);
                break;
            }

            watchdog_message_maple("Invalid code for LED off!\r\n", BPK_Code_Error);

            break;

        case BPK_REQUEST_PING:

            if (Bpacket->Code.val == BPK_Code_Execute.val) {
                uint8_t ping = WATCHDOG_PING_CODE_STM32;
                watchdog_create_and_send_bpacket_to_maple(BPK_Request_Ping, BPK_Code_Success, 1, &ping);
                break;
            }

            watchdog_message_maple("Invalid code for Ping!\r\n", BPK_Code_Error);

            break;

        case BPK_REQUEST_MESSAGE:
            uart_transmit_data(USART_MAPLE, Bpacket->Data.bytes, Bpacket->Data.numBytes);
            break;

        default:;
            char bpacketInfo[80];
            bpacket_get_info(Bpacket, bpacketInfo);
            char errorMsg[120];
            sprintf(errorMsg, "Error %s line %i. %s\r\n", __FILE__, __LINE__, bpacketInfo);
            watchdog_message_maple(errorMsg, BPK_Code_Error);
    }
}

uint8_t stm32_match_esp32_request(bpk_packet_t* Bpacket) {

    switch (Bpacket->Request.val) {

        case BPK_REQUEST_PING:
            esp32Connected = TRUE;
            LED_GREEN_PORT->BSRR |= (0x01 << LED_GREEN_PIN); // Turn green LED on
            break;

        case BPK_REQ_TAKE_PHOTO: // ESP32 Response to request from STM32 to take a photo

            if (Bpacket->Code.val == BPK_Code_Success.val) { // Photo was succesfully taken

#ifdef DEBUG
                watchdog_report_success(BPK_Req_Take_Photo);
#endif

                // TODO: Need to update RTC Alarm
                watchdog_message_maple("Need to update RTC alarm\r\n\0", BPK_Code_Todo);
                break;
            }

            // If photo could not be taken, print error code to Maple
            if (Bpacket->Code.val == BPK_Code_Error.val) {
                watchdog_create_and_send_bpacket_to_maple(BPK_Req_Take_Photo, BPK_Code_Error, Bpacket->Data.numBytes,
                                                          Bpacket->Data.bytes);
                break;
            }

            break;

        case BPK_REQ_GET_CAMERA_CAPTURE_TIMES:

            // Log success to Maple
            if (Bpacket->Code.val == BPK_Code_Success.val) {

                // Store watchdog settings in struct
                uint8_t result = wd_bpacket_to_capture_time_settings(Bpacket, &captureTime);

                if (result != TRUE) {
                    watchdog_message_maple("Failed to convert Bpacket to settings\r\n", BPK_Code_Error);
                    break;
                }

                // // Update the RTC time
                watchdog_calculate_rtc_alarm_time();

                // Report success
                watchdog_report_success(BPK_Req_Get_Camera_Capture_Times);
                break;
            }

            // If reading the watchdog settings fails, keep default settings
            if (Bpacket->Code.val == BPK_Code_Error.val) {
                watchdog_message_maple("Failed to read Watchdog settings\r\n", BPK_Code_Error);
                break;
            }

            watchdog_message_maple("ESP32 returned unknown code when request to get wd settings", BPK_Code_Error);

            break;

        case BPK_REQ_SET_CAMERA_CAPTURE_TIMES:

            // Log success to Maple
            if (Bpacket->Code.val == BPK_Code_Success.val) {
                watchdog_message_maple("Received capture time response from ESP32", BPK_Code_Debug);
                watchdog_report_success(BPK_Req_Set_Camera_Capture_Times);

                // Request read of capture time from ESP32 to update the settings on the STM32
                watchdog_create_and_send_bpacket_to_esp32(BPK_Req_Get_Camera_Capture_Times, BPK_Code_Execute, 0, NULL);
                break;
            }

            // Log failure to Maple
            if (Bpacket->Code.val == BPK_Code_Error.val) {
                watchdog_message_maple("Failed to write settings to ESP32", BPK_Code_Error);
            }

            watchdog_message_maple("ESP32 returned invalid code when udpating wd settings", BPK_Code_Error);

            break;

        default:
            return FALSE;
    }

    return TRUE;
}

void watchdog_calculate_rtc_alarm_time(void) {

    // Check whether the current RTC time is before or after the current capture time state time
    dt_datetime_t currentDateTime;
    stm32_rtc_read_datetime(&currentDateTime);

    if (dt_time_t1_leq_t2(&currentDateTime.Time, &captureTime.startTime) == TRUE) {

        // Set the alarm to be the start time of the capture time
        dt_datetime_t alarmA = {
            .Time.second = 0,
            .Time.minute = captureTime.startTime.minute,
            .Time.hour   = captureTime.startTime.hour,
            .Date.day    = currentDateTime.Date.day,
            .Date.month  = currentDateTime.Date.month,
            .Date.year   = currentDateTime.Date.year,
        };
        stm32_rtc_set_alarmA(&alarmA);

    } else if (dt_time_t1_leq_t2(&captureTime.endTime, &currentDateTime.Time) == TRUE) {

        // Increment to the following day
        dt_datetime_increment_day(&currentDateTime);

        // Set the alarm to be the start time
        dt_datetime_t alarmA = {
            .Time.second = 0,
            .Time.minute = captureTime.startTime.minute,
            .Time.hour   = captureTime.startTime.hour,
            .Date.day    = currentDateTime.Date.day,
            .Date.month  = currentDateTime.Date.month,
            .Date.year   = currentDateTime.Date.year,
        };

        stm32_rtc_set_alarmA(&alarmA);

    } else {

        dt_time_t alarmTime;
        dt_time_init(&alarmTime, captureTime.startTime.second, captureTime.startTime.minute,
                     captureTime.startTime.hour);

        // The next alarm is somewhere in between the start time and the end time
        while (1) {

            // Add interval time to the start time
            dt_time_add_time(&alarmTime, captureTime.intervalTime);

            // Check whether the time is now after the current RTC time
            if (dt_time_t1_leq_t2(&currentDateTime.Time, &alarmTime) == TRUE) {
                // Set the alarm time
                dt_datetime_t alarmA = {
                    .Time.second = 0,
                    .Time.minute = alarmTime.minute,
                    .Time.hour   = alarmTime.hour,
                    .Date.day    = currentDateTime.Date.day,
                    .Date.month  = currentDateTime.Date.month,
                    .Date.year   = currentDateTime.Date.year,
                };
                stm32_rtc_set_alarmA(&alarmA);
                break;
            }
        }
    }
}

uint8_t stm32_match_maple_request(bpk_packet_t* Bpacket) {

    bpk_buffer_t bpacketBuffer;
    uint8_t result;

    switch (Bpacket->Request.val) {

