gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
        case BPK_REQ_TAKE_PHOTO: // Send command to ESP32 to take a photo

            watchdog_request_esp32_take_photo();

            break;

        case BPK_REQ_GET_DATETIME:

            // Get the datetime from the RTC
            stm32_rtc_read_datetime(&datetime);
            if (wd_datetime_to_bpacket(Bpacket, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, Bpacket->Request,
                                       BPK_Code_Success, &datetime) == TRUE) {

                bpacket_to_buffer(Bpacket, &bpacketBuffer);
                comms_transmit(MAPLE_UART, bpacketBuffer.buffer, bpacketBuffer.numBytes);
            } else {
                watchdog_message_maple("Failed to convert datetime to Bpacket\0", BPK_Code_Error);
            }

            break;

        case BPK_REQ_SET_DATETIME:

            // Set the datetime using the information from the Bpacket
            if (wd_bpacket_to_datetime(Bpacket, &datetime) == TRUE) {

                stm32_rtc_write_datetime(&datetime);

                watchdog_report_success(BPK_Req_Set_Datetime);

                // Recalculate the RTC alarm
                watchdog_calculate_rtc_alarm_time();

            } else {
                watchdog_message_maple("Failed to convert Bpacket to datetime\r\n", BPK_Code_Error);
            }

            break;

        case BPK_REQUEST_STATUS:;

            // Currently what the status does is prints the gets the current date time and the current
            // RTC alarm time and sends that back
            dt_datetime_t currentDateTime, alarmATime;
            stm32_rtc_read_datetime(&currentDateTime);
            stm32_rtc_read_alarmA(&alarmATime);

            char cdtString[40];
            char atStr[40];
            stm32_rtc_format_datetime(&currentDateTime, cdtString);
            stm32_rtc_format_datetime(&alarmATime, atStr);

            // Combine the strings together
            char message[110];
            sprintf(message, "Current Time: %s, RTC Alarm: %s\r\n", cdtString, atStr);

            bpk_packet_t statusBpacket;
            bpacket_create_sp(&statusBpacket, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Request_Status,
                              BPK_Code_Success, message);
            bpacket_to_buffer(&statusBpacket, &bpacketBuffer);
            comms_transmit(MAPLE_UART, bpacketBuffer.buffer, bpacketBuffer.numBytes);

            break;

        case BPK_REQ_GET_CAMERA_CAPTURE_TIMES:;

            // Send the watchdog settings back to maple
            bpk_packet_t settingsPacket;
            result =
                wd_capture_time_settings_to_bpacket(&settingsPacket, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32,
                                                    BPK_Req_Get_Camera_Capture_Times, BPK_Code_Success, &captureTime);

            if (result != TRUE) {
                watchdog_message_maple("Failed to convert settings to Bpacket\r\n", BPK_Code_Error);
                break;
            } else {
                watchdog_message_maple("Converted settings to Bpacket. Sending to maple\r\n", BPK_Code_Debug);
            }

            // Send the Bpacket to maple
            bpacket_to_buffer(&settingsPacket, &bpacketBuffer);
            comms_transmit(MAPLE_UART, bpacketBuffer.buffer, bpacketBuffer.numBytes);

            break;

        case BPK_REQ_SET_CAMERA_CAPTURE_TIMES:;

            // Update the Bpacket addresses to redirect the request to the ESP32
            Bpacket->Receiver = BPK_Addr_Receive_Esp32;
            Bpacket->Sender   = BPK_Addr_Send_Stm32;

            watchdog_send_bpacket_to_esp32(Bpacket);

            break;

        case BPK_REQ_ESP32_ON:
            watchdog_esp32_on();
            watchdog_create_and_send_bpacket_to_maple(BPK_Req_Esp32_On, BPK_Code_Success, 0, NULL);
            break;

        case BPK_REQ_ESP32_OFF:
            watchdog_esp32_off();
            watchdog_create_and_send_bpacket_to_maple(BPK_Req_Esp32_Off, BPK_Code_Success, 0, NULL);
            break;

        default:
            return FALSE;
    }

    return TRUE;
}

void watchdog_request_esp32_take_photo(void) {

    // Record the current temperature from both temperature sensors
    if (ds18b20_read_temperature(DS18B20_SENSOR_ID_1) != TRUE) {
        watchdog_message_maple("Failed to read temperature", BPK_Code_Error);
    }

    cdt_dbl_16_t temp1;
    if (ds18b20_copy_temperature(DS18B20_SENSOR_ID_1, &temp1) != TRUE) {
        watchdog_message_maple("Failed to copy temperature", BPK_Code_Error);
    }

    if (ds18b20_read_temperature(DS18B20_SENSOR_ID_2) != TRUE) {
        watchdog_message_maple("Failed to read temperature", BPK_Code_Error);
    }

    cdt_dbl_16_t temp2;
    if (ds18b20_copy_temperature(DS18B20_SENSOR_ID_2, &temp2) != TRUE) {
        watchdog_message_maple("Failed to copy temperature", BPK_Code_Error);
    }

    // Update the datetime struct
    stm32_rtc_read_datetime(&datetime);

    // Get the real time clock time and date. Put it in a packet and send to the ESP32
    bpk_packet_t photoRequest;

    uint8_t result = wd_photo_data_to_bpacket(&photoRequest, BPK_Addr_Receive_Esp32, BPK_Addr_Send_Stm32,
                                              BPK_Req_Take_Photo, BPK_Code_Execute, &datetime, &temp1, &temp2);

    if (result == TRUE) {
        watchdog_send_bpacket_to_esp32(&photoRequest);
    } else {
        char errMsg[50];
        wd_get_error(result, errMsg);
        char msg[130];
        sprintf(msg, "Failed to convert photo data to Bpacket with error: %s\r\n", errMsg);
        watchdog_message_maple(msg, BPK_Code_Error);
    }
}

void watchdog_update(void) {

    // // Process anything the ESP32 sends to the STM32
    // if (comms_process_rxbuffer(BUFFER_1_ID, &esp32Bpacket) == TRUE) {
    //     if (stm32_match_esp32_request(&esp32Bpacket) != TRUE) {
    //         process_watchdog_stm32_request(&esp32Bpacket);
    //     }
    // }

    // // Process anything Maple sends to the STM32
    // if (comms_process_rxbuffer(BUFFER_2_ID, &mapleBpacket) == TRUE) {
    //     if (stm32_match_maple_request(&mapleBpacket) != TRUE) {
    //         process_watchdog_stm32_request(&mapleBpacket);
    //     }
    // }
}

void watchdog_esp32_on(void) {
    // Turn UART off for ESP32. This prevents STM32 from reading ESP32 UART which is in
    // non bpacket form
    comms_close_connection(ESP32_UART);

    ESP32_POWER_PORT->BSRR |= (0x01 << ESP32_POWER_PIN);

    // Delay for 1.5 seconds to let ESP32 startup
    HAL_Delay(1500);

    // Reopen the ESP32 uart connection
    comms_open_connection(ESP32_UART);

    // Ping the ESP32 to ensure it's communicating
    uint8_t pingCode = WATCHDOG_PING_CODE_ESP32;
    watchdog_create_and_send_bpacket_to_esp32(BPK_Request_Ping, BPK_Code_Execute, 1, &pingCode);
}

void watchdog_esp32_off(void) {
    ESP32_POWER_PORT->BSRR |= (0x10000 << ESP32_POWER_PIN);

    esp32Connected = FALSE;
    LED_GREEN_PORT->BSRR |= (0x10000 << LED_GREEN_PIN); // Turn green LED off
}